AccumulationRegisters/СведенияОДоходахНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>СведенияОДоходахНДФЛ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВыплатБывшимСотрудникам</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихДоходовФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДохода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВДекларациюПоНалогуНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьДоходВ6НДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДоходаФиксирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстаревшаяДатаПолученияДохода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОснованияНДФЛ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарегистрированоПриНачисленииАванса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключаетсяИзРасчетнойБазыИсполнительныхЛистов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаРаздела2Расчета6НДФЛ</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтрокиРаздела2Расчета6НДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложения</Name>
					<Comment>Ставка налогообложения конкретного дохода, если не указана, определяется по коду дохода и статусу налогового резидента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникДоходаЗаПределамиРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКодВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалогНаПрибыльДляДивидендов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыОснованияНДФЛ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУдержанияНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВДекларациюПоНалогуНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаченногоДохода</Name>
					<Comment>АПК:58 </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПеречисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиПеречисляемогоНалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокУплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВыплаченныйДоходВ6НДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДоходаФиксирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстаревшаяДатаПолученияДохода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗарегистрированоПриНачисленииАванса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Comment>АПК:58 имя сохранено ради обратной совместимости</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДохода</Name>
					<Comment>АПК:58 имя ВидДохода уже занято</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ВидыДоходовНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовНДФЛ</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора для сортировки, допустима история выбора при вводе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОблагаетсяУНалоговогоАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2010Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетРассчитываетсяАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетЕдинственныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетОплатеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2021Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодНалоговойОтчетностиС2021Года</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УчетФактическиПолученныхДоходовБазовый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Таблицу соответствия КодовДоходаНДФЛ, Категории начисления (для кода дохода 4800) и Категории дохода
// Если заполнен параметр КодДоходаНДФЛ тип СправочникСсылка.ВидыДоходовНДФЛ, то соответствие будет возвращено только
// для этого кода.
//
Функция СопоставлениеКодовИКатегорийДоходовНДФЛ(КодДоходаНДФЛ = Неопределено) Экспорт
	
	СоответствиеКодов = Новый ТаблицаЗначений;
	СоответствиеКодов.Колонки.Добавить("КодДохода", Новый ОписаниеТипов("СправочникСсылка.ВидыДоходовНДФЛ"));
	СоответствиеКодов.Колонки.Добавить("КатегорияДохода", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииДоходовНДФЛ"));
	СоответствиеКодов.Колонки.Добавить("КатегорияНачисления", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииНачисленийИНеоплаченногоВремени"));
	СоответствиеКодов.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1)));
	
	ДополнительныеДивиденды = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Перечисления.КатегорииДоходовНДФЛ.Дивиденды(), ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.КатегорииДоходовНДФЛ.Дивиденды));
	АвторскиеРоялти = Перечисления.КатегорииДоходовНДФЛ.АвторскиеРоялти();
	ПрочиеДоходыПоОблигациям = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыПоОблигациям);
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыДоходовНДФЛ.Ссылка КАК КодДохода,
	|	ВидыДоходовНДФЛ.КодПрименяемыйВНалоговойОтчетностиС2021Года КАК Код
	|ИЗ
	|	Справочник.ВидыДоходовНДФЛ КАК ВидыДоходовНДФЛ
	|ГДЕ
	|	&Условие";
	Если ЗначениеЗаполнено(КодДоходаНДФЛ) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ВидыДоходовНДФЛ.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", КодДоходаНДФЛ);
	Иначе
		Запрос.УстановитьПараметр("Условие", Истина);
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КатегорияДохода = УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Выборка.КодДохода);
		
		Если Выборка.Код = "2002" Тогда
			Если КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда Тогда
				ДополнительныеКатегории = Новый Массив;
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ДоходВНатуральнойФормеОтТрудовойДеятельности);
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН);
				УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеКатегории);
			Иначе // как прочие доходы от трудовой деятельности в денежной форме
				ДополнительныеКатегории = Новый Массив;
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
				УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеКатегории);
			КонецЕсли;
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ОплатаТруда Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеКатегории);
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыЗаймЦБ
			Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыИИС
			Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыОтДолевогоУчастия
			Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыПоВыигрышам
			Или КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыРЕПО Тогда
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода);
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыЦБ Тогда
			Если Выборка.Код = "1532"
				Или Выборка.Код = "1533"
				Или Выборка.Код = "1535" Тогда
				УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода);
			Иначе
				УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ПрочиеДоходыПоОблигациям);
			КонецЕсли;
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.Дивиденды Тогда
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеДивиденды);
			
			// Оплата труда в натуральной форме
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ДоходВНатуральнойФормеОтТрудовойДеятельности Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеКатегории);
			
		// Прочие доходы от трудовой деятельности в денежной форме
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			Если Выборка.Код = "2003"
				Или Выборка.Код = "2010" Тогда
				ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			КонецЕсли;
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода, ДополнительныеКатегории);
			
		ИначеЕсли Выборка.Код = "2720" Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы, ДополнительныеКатегории);
											
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы Тогда
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода);
			
		ИначеЕсли КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ Тогда
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, КатегорияДохода);
			
		ИначеЕсли Выборка.Код = "2015" Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы,
											ДополнительныеКатегории);
											
		// ПрочиеДоходы
		ИначеЕсли Выборка.Код = "1011"
			Или Выборка.Код = "1110"
			Или Выборка.Код = "1300"
			Или Выборка.Код = "1301"
			Или Выборка.Код = "2210" Тогда
			
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеКатегории, АвторскиеРоялти);
			
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы, 
											ДополнительныеКатегории);

		ИначеЕсли Выборка.Код = "2201"
			Или Выборка.Код = "2202"
			Или Выборка.Код = "2203"
			Или Выборка.Код = "2204"
			Или Выборка.Код = "2205"
			Или Выборка.Код = "2206"
			Или Выборка.Код = "2207"
			Или Выборка.Код = "2208"
			Или Выборка.Код = "2209" Тогда
			
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеКатегории, АвторскиеРоялти);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы, 
											ДополнительныеКатегории);
			
		ИначеЕсли Выборка.Код = "2760" Тогда
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы,
											ДополнительныеКатегории);
			
		// код 4800 обрабатываем отдельно
		ИначеЕсли Выборка.Код = "4800" Тогда
			
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности, 
											ДополнительныеКатегории,
											Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности, 
											ДополнительныеКатегории,
											Перечисления.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности, 
											ДополнительныеКатегории,
											Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности, 
											ДополнительныеКатегории,
											Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаКомандировки);
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы, 
											ДополнительныеКатегории,
											Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее);
			
		// все остальные
		Иначе
			ДополнительныеКатегории = Новый Массив;
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы);
			ДополнительныеКатегории.Добавить(Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыАУСН);
			УчетФактическиПолученныхДоходов.НовоеСоответствиеКодуДохода(СоответствиеКодов, Выборка.КодДохода, 
											Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходы, 
											ДополнительныеКатегории);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоответствиеКодов;
	
КонецФункции

// Регистрирует полученный доход "Начислятелей" на новую дату получения дохода
// Параметры:
//		Регистратор - ДокументСсылка - документ выплаты
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - должен содержать временные таблицы 
//      	ВТСписокСотрудников, с данными о выплатах вида:
//				ФизическоеЛицо: должно быть непустым
//          	СуммаВыплаты.
//          	ДокументОснование, необязательная
//          	СтатьяФинансирования, необязательная
//          	СтатьяРасходов, необязательная
//          	СуммаНачисленная, необязательная
//          	СуммаВыплаченная, необязательная, 
//			Если колонки СуммаНачисленная, СуммаВыплаченная отсутствуют, возможная частичная выплата не будет учтена.
//		Движения - коллекция движений регистратора.
//		ДатаВыплаты - дата - новая дата получения дохода.
//		ДатаОперации - дата - дата, которой будет зарегистрировано движение.
//		Отказ - признак отказа от заполнения движений.
//
Процедура ЗарегистрироватьНовуюДатуПолученияДохода(Регистратор, Движения, МенеджерВременныхТаблиц, ДатаВыплаты, ДатаОперации, Отказ, Записывать = Ложь) Экспорт
	
	Если Отказ Или ДатаВыплаты < УчетФактическиПолученныхДоходов.ДатаНачалаИспользованияПодсистемы() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыКУдалению = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ДоляПолнойВыплаты", УчетНДФЛ.ДоляПолнойВыплаты());
	
	ПеренесенныхДоходы = Новый ТаблицаЗначений;
	ПеренесенныхДоходы.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ПеренесенныхДоходы.Колонки.Добавить("КатегорияДохода", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииДоходовНДФЛ"));
	ПеренесенныхДоходы.Колонки.Добавить("ДокументОснование", Метаданные.ОпределяемыеТипы.ДокументыОснованияНДФЛ.Тип);
	ПеренесенныхДоходы.Колонки.Добавить("СуммаДохода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ПеренесенныхДоходы.Колонки.Добавить("ОбщаяСуммаДохода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ПеренесенныхДоходы.Колонки.Добавить("РанееПеренесеннаяСуммаДохода", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	ВТСписокСотрудников КАК ДанныеВедомости
	|ГДЕ
	|	ДанныеВедомости.СуммаВыплаты < 0";
	Если Запрос.Выполнить().Пустой() Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование КАК ДокументОснование,
		|	ДанныеВедомости.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ДанныеВедомости.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(ДанныеВедомости.СуммаВыплаты) КАК СуммаВыплаты,
		|	СУММА(ДанныеВедомости.СуммаНачисленная) КАК СуммаНачисленная,
		|	СУММА(ДанныеВедомости.СуммаВыплаченная) КАК СуммаВыплаченная
		|ПОМЕСТИТЬ ВТДанныеДляОтбора
		|ИЗ
		|	ВТСписокСотрудников КАК ДанныеВедомости
		|ГДЕ
		|	ДанныеВедомости.ДокументОснование <> НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеВедомости.ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование,
		|	ДанныеВедомости.СтатьяФинансирования,
		|	ДанныеВедомости.СтатьяРасходов
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеВедомости.СуммаВыплаты) > 0";
		КолонкиРезультата = МенеджерВременныхТаблиц.Таблицы["ВТСписокСотрудников"].Колонки;
		Если КолонкиРезультата.Найти("ДокументОснование") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.ДокументОснование", "НЕОПРЕДЕЛЕНО") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СуммаНачисленная") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СуммаНачисленная", "0") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СуммаВыплаченная") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СуммаВыплаченная", "0") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СтатьяФинансирования") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СтатьяФинансирования", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;
		Если КолонкиРезультата.Найти("СтатьяРасходов") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СтатьяРасходов", "НЕОПРЕДЕЛЕНО") 
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		
		ТаблицыКУдалению.Добавить("ВТДанныеДляОтбора");
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТПоложительныеДоходы
		|ИЗ
		|	ВТСписокСотрудников КАК ДанныеВедомости
		|ГДЕ
		|	ДанныеВедомости.ДокументОснование <> НЕОПРЕДЕЛЕНО
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеВедомости.ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеВедомости.СуммаВыплаты) > 0";
		КолонкиРезультата = МенеджерВременныхТаблиц.Таблицы["ВТСписокСотрудников"].Колонки;
		Если КолонкиРезультата.Найти("ДокументОснование") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.ДокументОснование", "НЕОПРЕДЕЛЕНО") 
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеВедомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование КАК ДокументОснование,
		|	ДанныеВедомости.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ДанныеВедомости.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(ДанныеВедомости.СуммаВыплаты) КАК СуммаВыплаты,
		|	СУММА(ДанныеВедомости.СуммаНачисленная) КАК СуммаНачисленная,
		|	СУММА(ДанныеВедомости.СуммаВыплаченная) КАК СуммаВыплаченная
		|ПОМЕСТИТЬ ВТДанныеДляОтбора
		|ИЗ
		|	ВТСписокСотрудников КАК ДанныеВедомости
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоложительныеДоходы КАК ПоложительныеДоходы
		|		ПО ДанныеВедомости.ФизическоеЛицо = ПоложительныеДоходы.ФизическоеЛицо
		|			И ДанныеВедомости.ДокументОснование = ПоложительныеДоходы.ДокументОснование
		|ГДЕ
		|	ДанныеВедомости.ДокументОснование <> НЕОПРЕДЕЛЕНО
		|	И ПоложительныеДоходы.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеВедомости.ФизическоеЛицо,
		|	ДанныеВедомости.ДокументОснование,
		|	ДанныеВедомости.СтатьяФинансирования,
		|	ДанныеВедомости.СтатьяРасходов
		|
		|ИМЕЮЩИЕ
		|	СУММА(ДанныеВедомости.СуммаВыплаты) > 0";
		КолонкиРезультата = МенеджерВременныхТаблиц.Таблицы["ВТСписокСотрудников"].Колонки;
		Если КолонкиРезультата.Найти("ДокументОснование") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.ДокументОснование", "НЕОПРЕДЕЛЕНО") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СуммаНачисленная") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СуммаНачисленная", "0") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СуммаВыплаченная") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СуммаВыплаченная", "0") 
		КонецЕсли;
		Если КолонкиРезультата.Найти("СтатьяФинансирования") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СтатьяФинансирования", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;
		Если КолонкиРезультата.Найти("СтатьяРасходов") = Неопределено Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеВедомости.СтатьяРасходов", "НЕОПРЕДЕЛЕНО") 
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() + ТекстЗапроса;
		
		ТаблицыКУдалению.Добавить("ВТПоложительныеДоходы");
		ТаблицыКУдалению.Добавить("ВТДанныеДляОтбора");
	КонецЕсли;
	Запрос.Выполнить();
	
	// Коэффициенты
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Выплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Выплаты.ДокументОснование КАК ДокументОснование,
	|	Выплаты.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Выплаты.СтатьяРасходов КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА Выплаты.СуммаНачисленная = 0
	|			ТОГДА 1
	|		КОГДА Выплаты.СуммаНачисленная < 0
	|				И Выплаты.СуммаВыплаты = Выплаты.СуммаНачисленная
	|			ТОГДА 1
	|		КОГДА Выплаты.СуммаВыплаченная + Выплаты.СуммаВыплаты > Выплаты.СуммаНачисленная * &ДоляПолнойВыплаты
	|			ТОГДА 1
	|		ИНАЧЕ Выплаты.СуммаВыплаты / Выплаты.СуммаНачисленная
	|	КОНЕЦ КАК ДоляВыплаты
	|ПОМЕСТИТЬ ВТКоэффициентыВыплатыПоСтатьям
	|ИЗ
	|	ВТДанныеДляОтбора КАК Выплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Выплаты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Выплаты.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТОснованияФизическихЛиц
	|ИЗ
	|	ВТКоэффициентыВыплатыПоСтатьям КАК Выплаты
	|ГДЕ
	|	Выплаты.ДоляВыплаты > 0";
	Запрос.Выполнить();
	ТаблицыКУдалению.Добавить("ВТКоэффициентыВыплатыПоСтатьям");
	ТаблицыКУдалению.Добавить("ВТОснованияФизическихЛиц");
	
	// Учет доходов для исчисления НДФЛ
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходахНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
	|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
	|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	СведенияОДоходахНДФЛ.СтавкаНалогообложения КАК СтавкаНалогообложения,
	|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СведенияОДоходахНДФЛ.Организация КАК Организация,
	|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
	|	СведенияОДоходахНДФЛ.Подразделение КАК Подразделение,
	|	СведенияОДоходахНДФЛ.Сотрудник КАК Сотрудник,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода КАК ДоходМежрасчетногоПериода,
	|	СведенияОДоходахНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	СведенияОДоходахНДФЛ.ПодразделениеСотрудника КАК ПодразделениеСотрудника,
	|	СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ КАК НеУчитыватьДоходВ6НДФЛ,
	|	СведенияОДоходахНДФЛ.СтатьяФинансирования КАК СтатьяФинансирования,
	|	СведенияОДоходахНДФЛ.СтатьяРасходов КАК СтатьяРасходов,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	СведенияОДоходахНДФЛ.ДокументОснование КАК ДокументОснование,
	|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2Расчета6НДФЛ,
	|	СведенияОДоходахНДФЛ.ЗарегистрированоПриНачисленииАванса КАК ЗарегистрированоПриНачисленииАванса,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА СведенияОДоходахНДФЛ.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаДохода,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА СведенияОДоходахНДФЛ.СуммаВычета
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаВычета,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходахНДФЛ.Регистратор = СведенияОДоходахНДФЛ.ДокументОснование
	|				ТОГДА СведенияОДоходахНДФЛ.СуммаДохода
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВаловаяСуммаДохода,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходахНДФЛ.Регистратор = СведенияОДоходахНДФЛ.ДокументОснование
	|				ТОГДА СведенияОДоходахНДФЛ.СуммаВычета
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВаловаяСуммаВычета,
	|	СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода КАК УстаревшаяДатаПолученияДохода,
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ СведенияОДоходахНДФЛ.СуммаДохода
	|		КОНЕЦ) КАК ПеренесеннаяСуммаДохода
	|ПОМЕСТИТЬ ВТЗаписиДоходов
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ КАК СведенияОДоходахНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОснованияФизическихЛиц КАК Выплаты
	|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = Выплаты.ФизическоеЛицо
	|			И СведенияОДоходахНДФЛ.ДокументОснование = Выплаты.ДокументОснование
	|ГДЕ
	|	СведенияОДоходахНДФЛ.Регистратор <> &Регистратор
	|	И НЕ СведенияОДоходахНДФЛ.ДатаПолученияДоходаФиксирована
	|	И СведенияОДоходахНДФЛ.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|	И СведенияОДоходахНДФЛ.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ,
	|	СведенияОДоходахНДФЛ.СтатьяРасходов,
	|	СведенияОДоходахНДФЛ.СтавкаНалогообложения,
	|	СведенияОДоходахНДФЛ.ДокументОснование,
	|	СведенияОДоходахНДФЛ.Начисление,
	|	СведенияОДоходахНДФЛ.СтатьяФинансирования,
	|	СведенияОДоходахНДФЛ.МесяцНалоговогоПериода,
	|	СведенияОДоходахНДФЛ.ГоловнаяОрганизация,
	|	СведенияОДоходахНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль,
	|	СведенияОДоходахНДФЛ.КодВычета,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДоходаФиксирована,
	|	СведенияОДоходахНДФЛ.КатегорияДохода,
	|	СведенияОДоходахНДФЛ.ПодразделениеСотрудника,
	|	СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода,
	|	СведенияОДоходахНДФЛ.Сотрудник,
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо,
	|	СведенияОДоходахНДФЛ.Организация,
	|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДохода,
	|	СведенияОДоходахНДФЛ.Подразделение,
	|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ,
	|	СведенияОДоходахНДФЛ.КодДохода,
	|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ,
	|	СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода,
	|	СведенияОДоходахНДФЛ.ЗарегистрированоПриНачисленииАванса
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА СведенияОДоходахНДФЛ.СуммаДохода
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				КОГДА СведенияОДоходахНДФЛ.Регистратор = СведенияОДоходахНДФЛ.ДокументОснование
	|					ТОГДА СведенияОДоходахНДФЛ.СуммаДохода
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ СведенияОДоходахНДФЛ.СуммаДохода
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	СведенияОДоходахНДФЛ.ДокументОснование КАК ДокументОснование,
	|	СУММА(СведенияОДоходахНДФЛ.ВаловаяСуммаДохода) КАК СуммаДохода,
	|	СУММА(СведенияОДоходахНДФЛ.ПеренесеннаяСуммаДохода) КАК ПеренесеннаяСуммаДохода
	|ПОМЕСТИТЬ ВТИтогиПоДокументам
	|ИЗ
	|	ВТЗаписиДоходов КАК СведенияОДоходахНДФЛ
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахНДФЛ.ДокументОснование,
	|	СведенияОДоходахНДФЛ.КатегорияДохода,
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОДоходахНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	СведенияОДоходахНДФЛ.КодДохода КАК КодДохода,
	|	СведенияОДоходахНДФЛ.КодВычета КАК КодВычета,
	|	СведенияОДоходахНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	СведенияОДоходахНДФЛ.СтавкаНалогообложения КАК СтавкаНалогообложения,
	|	СведенияОДоходахНДФЛ.ИсточникДоходаЗаПределамиРФ КАК ИсточникДоходаЗаПределамиРФ,
	|	СведенияОДоходахНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СведенияОДоходахНДФЛ.Организация КАК Организация,
	|	СведенияОДоходахНДФЛ.Начисление КАК Начисление,
	|	СведенияОДоходахНДФЛ.Подразделение КАК Подразделение,
	|	СведенияОДоходахНДФЛ.Сотрудник КАК Сотрудник,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	СведенияОДоходахНДФЛ.ДоходМежрасчетногоПериода КАК ДоходМежрасчетногоПериода,
	|	СведенияОДоходахНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	СведенияОДоходахНДФЛ.ПодразделениеСотрудника КАК ПодразделениеСотрудника,
	|	СведенияОДоходахНДФЛ.НеУчитыватьДоходВ6НДФЛ КАК НеУчитыватьДоходВ6НДФЛ,
	|	СведенияОДоходахНДФЛ.СтатьяФинансирования КАК СтатьяФинансирования,
	|	СведенияОДоходахНДФЛ.СтатьяРасходов КАК СтатьяРасходов,
	|	СведенияОДоходахНДФЛ.ДатаПолученияДоходаФиксирована КАК ДатаПолученияДоходаФиксирована,
	|	СведенияОДоходахНДФЛ.ДокументОснование КАК ДокументОснование,
	|	СведенияОДоходахНДФЛ.СуммаДохода КАК СуммаДохода,
	|	СведенияОДоходахНДФЛ.СуммаВычета КАК СуммаВычета,
	|	СведенияОДоходахНДФЛ.ВаловаяСуммаДохода КАК ВаловаяСуммаДохода,
	|	СведенияОДоходахНДФЛ.ВаловаяСуммаВычета КАК ВаловаяСуммаВычета,
	|	СведенияОДоходахНДФЛ.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2Расчета6НДФЛ,
	|	СведенияОДоходахНДФЛ.ЗарегистрированоПриНачисленииАванса КАК ЗарегистрированоПриНачисленииАванса,
	|	ЕСТЬNULL(ВаловыеСуммы.СуммаДохода, 0) КАК СуммаДоходаДокумента,
	|	ЕСТЬNULL(ВаловыеСуммы.ПеренесеннаяСуммаДохода, 0) КАК ПеренесеннаяСуммаДохода,
	|	Выплаты.ДоляВыплаты КАК ДоляВыплаты
	|ИЗ
	|	ВТЗаписиДоходов КАК СведенияОДоходахНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоэффициентыВыплатыПоСтатьям КАК Выплаты
	|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = Выплаты.ФизическоеЛицо
	|			И СведенияОДоходахНДФЛ.ДокументОснование = Выплаты.ДокументОснование
	|			И (СведенияОДоходахНДФЛ.СтатьяФинансирования = Выплаты.СтатьяФинансирования
	|				ИЛИ Выплаты.СтатьяФинансирования = НЕОПРЕДЕЛЕНО)
	|			И (СведенияОДоходахНДФЛ.СтатьяРасходов = Выплаты.СтатьяРасходов
	|				ИЛИ Выплаты.СтатьяРасходов = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиПоДокументам КАК ВаловыеСуммы
	|		ПО СведенияОДоходахНДФЛ.ФизическоеЛицо = ВаловыеСуммы.ФизическоеЛицо
	|			И СведенияОДоходахНДФЛ.КатегорияДохода = ВаловыеСуммы.КатегорияДохода
	|			И СведенияОДоходахНДФЛ.ДокументОснование = ВаловыеСуммы.ДокументОснование
	|ГДЕ
	|	СведенияОДоходахНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|	И Выплаты.ДоляВыплаты > 0";
	ТаблицыКУдалению.Добавить("ВТЗаписиДоходов");
	ТаблицыКУдалению.Добавить("ВТИтогиПоДокументам");
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ФизическиеЛица = Новый Массив;
		Организация = Неопределено;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СуммаДохода = 0;
			СуммаВычета = 0;
			Если Выборка.СуммаДохода * Выборка.СуммаДохода > (Выборка.ВаловаяСуммаДохода * Выборка.ДоляВыплаты) * (Выборка.ВаловаяСуммаДохода * Выборка.ДоляВыплаты) Тогда
				СуммаДохода = Выборка.ВаловаяСуммаДохода * Выборка.ДоляВыплаты;
			Иначе
				СуммаДохода = Выборка.СуммаДохода;
			КонецЕсли;
			Если Выборка.СуммаВычета * Выборка.СуммаВычета > (Выборка.ВаловаяСуммаВычета * Выборка.ДоляВыплаты) * (Выборка.ВаловаяСуммаВычета * Выборка.ДоляВыплаты) Тогда
				СуммаВычета = Выборка.ВаловаяСуммаВычета * Выборка.ДоляВыплаты;
			Иначе
				СуммаВычета = Выборка.СуммаВычета;
			КонецЕсли;
			
			ПеренесенныйДоход = ПеренесенныхДоходы.Добавить();
			ПеренесенныйДоход.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			ПеренесенныйДоход.ДокументОснование = Выборка.ДокументОснование;
			ПеренесенныйДоход.КатегорияДохода = Выборка.КатегорияДохода;
			ПеренесенныйДоход.СуммаДохода = СуммаДохода;
			ПеренесенныйДоход.ОбщаяСуммаДохода = Выборка.СуммаДоходаДокумента;
			ПеренесенныйДоход.РанееПеренесеннаяСуммаДохода = Выборка.ПеренесеннаяСуммаДохода;
			
			Если СуммаДохода = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			НовоеДвижение = Движения.СведенияОДоходахНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
			НовоеДвижение.СуммаДохода = - СуммаДохода;
			НовоеДвижение.СуммаВычета = - СуммаВычета;
			НовоеДвижение.Период = ДатаОперации;
			
			НовоеДвижение = Движения.СведенияОДоходахНДФЛ.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
			НовоеДвижение.СуммаДохода = СуммаДохода;
			НовоеДвижение.СуммаВычета = СуммаВычета;
			НовоеДвижение.УстаревшаяДатаПолученияДохода = Выборка.ДатаПолученияДохода;
			НовоеДвижение.ДатаПолученияДохода = ДатаВыплаты;
			НовоеДвижение.МесяцНалоговогоПериода = НачалоМесяца(ДатаВыплаты);
			НовоеДвижение.Период = ДатаОперации;
			
			ФизическиеЛица.Добавить(Выборка.ФизическоеЛицо);
			Если Не ЗначениеЗаполнено(Организация) Тогда
				Организация = Выборка.Организация
			КонецЕсли;
		КонецЦикла;
		Если Записывать Тогда
			Движения.СведенияОДоходахНДФЛ.Записать();
			Движения.СведенияОДоходахНДФЛ.Записывать = Ложь;
		Иначе
			Движения.СведенияОДоходахНДФЛ.Записывать = Истина;
		КонецЕсли;
		УчетНДФЛ.СформироватьДокументыУчтенныеПриРасчетеДляМежрасчетногоДокумента(Движения, Отказ, Организация, ФизическиеЛица, Регистратор);
	КонецЕсли;
	
	// Расчеты налогоплательщиков с бюджетом по НДФЛ
	ПеренесенныхДоходы.Свернуть("ФизическоеЛицо, ДокументОснование, КатегорияДохода, ОбщаяСуммаДохода, РанееПеренесеннаяСуммаДохода", "СуммаДохода");
	ВсегоСтрок = ПеренесенныхДоходы.Количество();
	Для Инд = 1 По ВсегоСтрок Цикл
		СтрокаДохода = ПеренесенныхДоходы[ВсегоСтрок - Инд];
		Если СтрокаДохода.СуммаДохода = 0 Тогда
			ПеренесенныхДоходы.Удалить(СтрокаДохода);
		КонецЕсли;
	КонецЦикла;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(Запрос.МенеджерВременныхТаблиц, ПеренесенныхДоходы, "ВТПеренесенныеДоходы");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК СоединятьПоДокументам,
	|	ПеренесенныеДоходы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПеренесенныеДоходы.КатегорияДохода КАК КатегорияДохода,
	|	ПеренесенныеДоходы.ДокументОснование КАК ДокументОснование,
	|	ПеренесенныеДоходы.СуммаДохода КАК СуммаДохода,
	|	ПеренесенныеДоходы.ОбщаяСуммаДохода КАК ОбщаяСуммаДохода,
	|	ПеренесенныеДоходы.РанееПеренесеннаяСуммаДохода КАК РанееПеренесеннаяСуммаДохода
	|ПОМЕСТИТЬ ВТДолиПеренесенныхДоходов
	|ИЗ
	|	ВТПеренесенныеДоходы КАК ПеренесенныеДоходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ПеренесенныеДоходы.ФизическоеЛицо,
	|	ПеренесенныеДоходы.КатегорияДохода,
	|	НЕОПРЕДЕЛЕНО,
	|	СУММА(ПеренесенныеДоходы.СуммаДохода),
	|	СУММА(ПеренесенныеДоходы.ОбщаяСуммаДохода),
	|	0
	|ИЗ
	|	ВТПеренесенныеДоходы КАК ПеренесенныеДоходы
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеренесенныеДоходы.ФизическоеЛицо,
	|	ПеренесенныеДоходы.КатегорияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДляОтбора.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДляОтбора.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТОснованияИсчисленногоНалога
	|ИЗ
	|	ВТДанныеДляОтбора КАК ДанныеДляОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	ВЫБОР
	|		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
	|		ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода
	|	КОНЕЦ КАК МесяцНалоговогоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода КАК УстаревшаяДатаПолученияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация КАК Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода КАК КодДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение КАК Подразделение,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ КАК УчитыватьВыплаченныйДоходВ6НДФЛ,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ЗарегистрированоПриНачисленииАванса КАК ЗарегистрированоПриНачисленииАванса,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСПревышения,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
	|				ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВаловаяСумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор = РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование
	|				ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВаловаяСуммаСПревышения,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|		КОНЕЦ) КАК ПеренесеннаяСумма,
	|	СУММА(ВЫБОР
	|			КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|		КОНЕЦ) КАК ПеренесеннаяСуммаСПревышения
	|ПОМЕСТИТЬ ВТРасчетыНалогоплательщиков
	|ИЗ
	|	РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОснованияИсчисленногоНалога КАК Основания
	|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = Основания.ФизическоеЛицо
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование = Основания.ДокументОснование
	|ГДЕ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Регистратор <> &Регистратор
	|	И НЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДатаПолученияДоходаФиксирована
	|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ПустаяСсылка)
	|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода <> ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ДоходыПредыдущихРедакций)
	|	И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение,
	|	ВЫБОР
	|		КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода
	|		ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода
	|	КОНЕЦ,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ЗарегистрированоПриНачисленииАванса,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА 0
	|				ИНАЧЕ РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода КАК КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация КАК Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода КАК КодДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение КАК Подразделение,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование КАК ДокументОснование,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания КАК ВариантУдержания,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль КАК ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода КАК РасчетМежрасчетногоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления КАК СрокПеречисления,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты КАК КрайнийСрокУплаты,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ КАК УчитыватьВыплаченныйДоходВ6НДФЛ,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма КАК Сумма,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВаловаяСумма КАК ВаловаяСумма,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения КАК СуммаСПревышения,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВаловаяСуммаСПревышения КАК ВаловаяСуммаСПревышения,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ЗарегистрированоПриНачисленииАванса КАК ЗарегистрированоПриНачисленииАванса,
	|	ЕСТЬNULL(ПеренесенныеСуммыНалога.ПеренесеннаяСумма, 0) КАК ПеренесеннаяСумма,
	|	ЕСТЬNULL(ПеренесенныеСуммыНалога.ПеренесеннаяСуммаСПревышения, 0) КАК ПеренесеннаяСуммаСПревышения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Выплаты.ОбщаяСуммаДохода, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ Выплаты.СуммаДохода / Выплаты.ОбщаяСуммаДохода
	|	КОНЕЦ КАК ДоляВыплаты,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Выплаты.ОбщаяСуммаДохода, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ (Выплаты.СуммаДохода + Выплаты.РанееПеренесеннаяСуммаДохода) / Выплаты.ОбщаяСуммаДохода
	|	КОНЕЦ КАК ДоляВыплатыСУчетомПеренесенныхСумм
	|ИЗ
	|	ВТРасчетыНалогоплательщиков КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДолиПеренесенныхДоходов КАК Выплаты
	|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = Выплаты.ФизическоеЛицо
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = Выплаты.КатегорияДохода
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование = Выплаты.ДокументОснование
	|			И (Выплаты.СоединятьПоДокументам)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетыНалогоплательщиков КАК ПеренесенныеСуммыНалога
	|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ = ПеренесенныеСуммыНалога.УчитыватьВыплаченныйДоходВ6НДФЛ
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты = ПеренесенныеСуммыНалога.КрайнийСрокУплаты
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления = ПеренесенныеСуммыНалога.СрокПеречисления
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода = ПеренесенныеСуммыНалога.РасчетМежрасчетногоПериода
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль = ПеренесенныеСуммыНалога.ВключатьВДекларациюПоНалогуНаПрибыль
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания = ПеренесенныеСуммыНалога.ВариантУдержания
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование = ПеренесенныеСуммыНалога.ДокументОснование
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение = ПеренесенныеСуммыНалога.Подразделение
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане = ПеренесенныеСуммыНалога.РегистрацияВНалоговомОргане
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = ПеренесенныеСуммыНалога.КатегорияДохода
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента = ПеренесенныеСуммыНалога.СтавкаНалогообложенияРезидента
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = ПеренесенныеСуммыНалога.ФизическоеЛицо
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация = ПеренесенныеСуммыНалога.ГоловнаяОрганизация
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация = ПеренесенныеСуммыНалога.Организация
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода = ПеренесенныеСуммыНалога.КодДохода
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода = ПеренесенныеСуммыНалога.МесяцНалоговогоПериода
	|			И (ПеренесенныеСуммыНалога.УстаревшаяДатаПолученияДохода <> ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(Выплаты.ОбщаяСуммаДохода, 0) = 0
	|				ТОГДА 1
	|			ИНАЧЕ Выплаты.СуммаДохода / Выплаты.ОбщаяСуммаДохода
	|		КОНЕЦ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ГоловнаяОрганизация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СтавкаНалогообложенияРезидента,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РегистрацияВНалоговомОргане,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Организация,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КодДохода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Подразделение,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВариантУдержания,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВключатьВДекларациюПоНалогуНаПрибыль,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.РасчетМежрасчетногоПериода,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СрокПеречисления,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КрайнийСрокУплаты,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УчитыватьВыплаченныйДоходВ6НДФЛ,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Сумма,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВаловаяСумма,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СуммаСПревышения,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ВаловаяСуммаСПревышения,
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ЗарегистрированоПриНачисленииАванса КАК ЗарегистрированоПриНачисленииАванса,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Выплаты.ОбщаяСуммаДохода, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ Выплаты.СуммаДохода / Выплаты.ОбщаяСуммаДохода
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	ВТРасчетыНалогоплательщиков КАК РасчетыНалогоплательщиковСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДолиПеренесенныхДоходов КАК Выплаты
	|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = Выплаты.ФизическоеЛицо
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = Выплаты.КатегорияДохода
	|			И (Выплаты.СоединятьПоДокументам = ЛОЖЬ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДолиПеренесенныхДоходов КАК УчтенныеВыплаты
	|		ПО РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ФизическоеЛицо = УчтенныеВыплаты.ФизическоеЛицо
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.КатегорияДохода = УчтенныеВыплаты.КатегорияДохода
	|			И РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДокументОснование = УчтенныеВыплаты.ДокументОснование
	|			И (УчтенныеВыплаты.СоединятьПоДокументам)
	|ГДЕ
	|	РасчетыНалогоплательщиковСБюджетомПоНДФЛ.УстаревшаяДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)
	|	И УчтенныеВыплаты.ФизическоеЛицо ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(Выплаты.ОбщаяСуммаДохода, 0) = 0
	|				ТОГДА 1
	|			ИНАЧЕ Выплаты.СуммаДохода / Выплаты.ОбщаяСуммаДохода
	|		КОНЕЦ > 0";
	ТаблицыКУдалению.Добавить("ВТПеренесенныеДоходы");
	ТаблицыКУдалению.Добавить("ВТДолиПеренесенныхДоходов");
	ТаблицыКУдалению.Добавить("ВТОснованияИсчисленногоНалога");
	ТаблицыКУдалению.Добавить("ВТРасчетыНалогоплательщиков");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Сумма = 0;
		СуммаСПревышения = 0;
		
		УчитыватьРанееПеренесенныеСуммы = Истина;
		Если Выборка.ДоляВыплаты = Выборка.ДоляВыплатыСУчетомПеренесенныхСумм 
			Или (Выборка.ПеренесеннаяСумма = 0 И Выборка.ПеренесеннаяСуммаСПревышения = 0) Тогда
			УчитыватьРанееПеренесенныеСуммы = Ложь;
		КонецЕсли;
		
		Если УчитыватьРанееПеренесенныеСуммы Тогда
			
			ДоляВыплаты = Выборка.ДоляВыплатыСУчетомПеренесенныхСумм;
			
			Если Выборка.Сумма * Выборка.Сумма > (Выборка.ВаловаяСумма * ДоляВыплаты - Выборка.ПеренесеннаяСумма) * (Выборка.ВаловаяСумма * ДоляВыплаты - Выборка.ПеренесеннаяСумма) Тогда
				Сумма = Выборка.ВаловаяСумма * ДоляВыплаты - Выборка.ПеренесеннаяСумма;
			Иначе
				Сумма = Выборка.Сумма;
				Если Сумма <> 0 Тогда
					УчитыватьРанееПеренесенныеСуммы = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если Выборка.СуммаСПревышения * Выборка.СуммаСПревышения > (Выборка.ВаловаяСуммаСПревышения * ДоляВыплаты - Выборка.ПеренесеннаяСуммаСПревышения) * (Выборка.ВаловаяСуммаСПревышения * ДоляВыплаты - Выборка.ПеренесеннаяСуммаСПревышения) Тогда
				СуммаСПревышения = Выборка.ВаловаяСуммаСПревышения * ДоляВыплаты - Выборка.ПеренесеннаяСуммаСПревышения;
			Иначе
				СуммаСПревышения = Выборка.СуммаСПревышения;
				Если СуммаСПревышения <> 0 Тогда
					УчитыватьРанееПеренесенныеСуммы = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не УчитыватьРанееПеренесенныеСуммы Тогда
			
			ДоляВыплаты = Выборка.ДоляВыплаты;
			
			Если Выборка.Сумма * Выборка.Сумма > (Выборка.ВаловаяСумма * Выборка.ДоляВыплаты) * (Выборка.ВаловаяСумма * Выборка.ДоляВыплаты) Тогда
				Сумма = Выборка.ВаловаяСумма * Выборка.ДоляВыплаты;
			Иначе
				Сумма = Выборка.Сумма;
			КонецЕсли;
			Если Выборка.СуммаСПревышения * Выборка.СуммаСПревышения > (Выборка.ВаловаяСуммаСПревышения * Выборка.ДоляВыплаты) * (Выборка.ВаловаяСуммаСПревышения * Выборка.ДоляВыплаты) Тогда
				СуммаСПревышения = Выборка.ВаловаяСуммаСПревышения * Выборка.ДоляВыплаты;
			Иначе
				СуммаСПревышения = Выборка.СуммаСПревышения;
			КонецЕсли;
			
		КонецЕсли;
	
		Если Сумма = 0 И СуммаСПревышения = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НовоеДвижение = Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
		НовоеДвижение.Сумма = - Сумма;
		НовоеДвижение.СуммаСПревышения = - СуммаСПревышения;
		НовоеДвижение.Период = ДатаОперации;
		
		НовоеДвижение = Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(НовоеДвижение, Выборка);
		НовоеДвижение.Сумма = Сумма;
		НовоеДвижение.СуммаСПревышения = СуммаСПревышения;
		НовоеДвижение.УстаревшаяДатаПолученияДохода = Выборка.МесяцНалоговогоПериода;
		НовоеДвижение.МесяцНалоговогоПериода = ДатаВыплаты;
		НовоеДвижение.Период = ДатаОперации;
		
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Записать();
		Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Записывать = Ложь;
	Иначе
		Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Записывать = Истина;
	КонецЕсли;
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, ТаблицыКУдалению);
	
КонецПроцедуры

#КонецОбласти
